tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/versions"

# Command line
brew "fish"
brew "git"
brew "jq"
brew "md5sha1sum"
brew "nginx"
brew "p7zip"
brew "sshuttle"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "wget"
brew "openssl"
brew "htop"

# Editors
brew "vim"
cask "visual-studio-code"
cask "intellij-idea-ce"

# Languages
brew "go"
cask "java8"
cask "java"
brew "gradle"
brew "protobuf"
brew "python3"
brew "node"

# Fonts
cask "caskroom/fonts/font-inconsolata-g-for-powerline"
cask "caskroom/fonts/font-dejavu-sans-mono-for-powerline"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-fira-code"

# Apps
cask "iterm2"
cask "android-file-transfer"
cask "dropbox"
cask "spectacle"
cask "gitify"

# Unproductivity
cask "spotify"
cask "vlc"
cask "aerial"

# Devtools
brew "hub"
brew "ansible"
cask "slack"
cask "vagrant"
cask "docker"
cask "insomnia"
cask "psequel"

# Browser
cask "google-chrome"
cask "firefoxdeveloperedition"
